In [ ]:
-- 코드를 입력하세요
SELECT CAR_ID, ROUND(AVG(DATEDIFF(END_DATE,START_DATE)+1),1) AS AVERAGE_DURATION
FROM CAR_RENTAL_COMPANY_RENTAL_HISTORY
GROUP BY CAR_ID
HAVING AVG(DATEDIFF(END_DATE,START_DATE)+1) >= 7
ORDER BY AVERAGE_DURATION DESC, CAR_ID DESC;

//DATEDIFF를 사용했을 경우 시작일과 마지막날짜의 차이만 계산하기 떄문에 +1을 진행해 시작일을 포함해줘야함

In [ ]:
-- 코드를 입력하세요
SELECT BOARD_ID,WRITER_ID,TITLE,PRICE,
CASE STATUS 
WHEN 'SALE' THEN '판매중'
WHEN 'RESERVED' THEN '예약중'
WHEN 'DONE' THEN '거래완료'
END AS STATUS
FROM USED_GOODS_BOARD
WHERE DATE_FORMAT(CREATED_DATE, '%Y-%m-%d') = '2022-10-05'
ORDER BY BOARD_ID DESC;

//기본적으로 CASE WHEN에는 ,를 넣지않고 진행한다. 항상 끝에는 END를 사용해서 마무리 해야함 
DATE_FORMAT(CREATED_DATE, '%Y-%m-%d') = '2022-10-05' DATE_FORMAT을 사용해서 날짜를 뽑아도 되고, 
YEAR(CREATED_DATE) = 2022 AND MONTH(CREATED_DATE) = 10 AND DAY(CREATED_DATE) = 5 이 방식으로도 가능하다.

In [ ]:
-- 코드를 입력하세요
SELECT DATETIME AS '시간'
FROM ANIMAL_INS 
ORDER BY DATETIME ASC
LIMIT 1;

"""
동물 보호소에 가장 먼저 들어온 동물은 언제 들어왔는지 조회하는 SQL 문을 작성할 때 위와 같은 방식으로 진행해도 되고,
SELECT MIN(DATETIME) AS '시간'
FROM ANIMAL_INS; 
해당방식으로 진행해도 됨
"""

### 1일차 -------------------------------------------------------------------------------

In [ ]:
-- 코드를 입력하세요
SELECT ANIMAL_ID,NAME, 
CASE SEX_UPON_INTAKE 
WHEN 'Neutered Male' THEN 'O'
WHEN 'Spayed Female' THEN 'O'
WHEN 'Intact Male' THEN 'X'
END AS '중성화'
FROM ANIMAL_INS 
ORDER BY ANIMAL_ID ASC;

----------------------------------------------------------
SELECT ANIMAL_ID,
       NAME,
       CASE
           WHEN SEX_UPON_INTAKE LIKE '%Neutered%' THEN 'O'
           WHEN SEX_UPON_INTAKE LIKE '%Spayed%'  THEN 'O'
           ELSE 'X'
       END AS 중성화
FROM ANIMAL_INS
ORDER BY ANIMAL_ID ASC;

//문제에서는 SEX_UPON_INTAKE 칼럼안에 3개의 상태에서 대해서만 말했서 전자와 같은 방식으로 진행해서 실행했을 떄 값을 잘 나왔지만 틀리는 경우로 발생
이유로는 문제에는 안보였지만, 다른 값들이 존재했기 떄문임 그래서 해결방법으로 
두개의 경우가 아닌경우에는 X로 치환했을 떄 성공적으로 실행됨

In [ ]:
-- 코드를 입력하세요
SELECT 
CASE 
WHEN PRODUCT_ID IN (1,2) THEN 'A1' 
WHEN PRODUCT_ID IN (3,4,5) THEN 'C3' 
WHEN PRODUCT_ID IN (6) THEN 'K1'
END AS CATEGORY,COUNT(*) AS PRODUCTS
FROM PRODUCT
GROUP BY CATEGORY
ORDER BY CATEGORY ASC;
-------------------------------------------------------------------
SELECT LEFT(PRODUCT_CODE, 2) AS CATEGORY,
       COUNT(*) AS PRODUCTS
FROM PRODUCT
GROUP BY LEFT(PRODUCT_CODE, 2)
ORDER BY CATEGORY ASC;

//처음에는 PRODUCT_ID의 첫 2글자만 추출해서 숫자에 맞게 A1,C3,K1을 설정해주면 될 줄 알아서 CASE문을 사용했지만 예제를 실행했을 때 6이상의 숫자들이 나와서 NULL값이 나와서
틀리기 되는 상황이 나와버렸다. 이 문제를 해결하기 위해서는 CASE문을 사용하지말고 앞 두글자를 추출해서 하면 되는 후자방법을 사용하면 된다.

In [ ]:
-- 코드를 입력하세요
SELECT HOUR(DATETIME) AS HOUR, COUNT(*) AS COUNT
FROM ANIMAL_OUTS 
WHERE HOUR(DATETIME) BETWEEN 9 AND 19
GROUP BY HOUR
ORDER BY HOUR ASC;

//09시부터 19:59시까지 1시간단위로 조회를 진행해야 할 때 시간단위는 HOUR를 통해서 끊고, 시간은 WHERE 조건을 이용해서 필터링한다.

In [ ]:
-- 코드를 입력하세요
SELECT CASE
WHEN PRICE BETWEEN 0 AND 9999 THEN '0'
WHEN PRICE BETWEEN 10000 AND 19999 THEN '10000'
WHEN PRICE BETWEEN 20000 AND 29999 THEN '20000'
WHEN PRICE BETWEEN 30000 AND 39999 THEN '30000'
END AS PRICE_GROUP,
COUNT(*) AS PRODUCTS
FROM PRODUCT 
GROUP  BY PRICE_GROUP
ORDER BY PRICE_GROUP ASC;
-----------------------------------------------------

SELECT 
    (PRICE DIV 10000) * 10000 AS PRICE_GROUP,
    COUNT(*) AS PRODUCTS
FROM PRODUCT
GROUP BY PRICE_GROUP
ORDER BY PRICE_GROUP ASC;

//전자처럼 해버리면 출력시 해당 조건값만 있는게 아닐 경우에는 조건값이 아닌경우들이 카운트가 되버려서 실행시 표시가 안되는 모습이 보여지기 때문에, 후자와 같이 가격을 10000으로
나누어 한자리수의 정수로 만든 후에 10000을 곱해 구간을 정해준다.

In [ ]:
-- 코드를 입력하세요
SELECT A.PRODUCT_CODE, SUM(A.PRICE * B.SALES_AMOUNT) AS SALES
FROM PRODUCT A JOIN OFFLINE_SALE B ON A.PRODUCT_ID = B.PRODUCT_ID
GROUP BY A.PRODUCT_CODE
ORDER BY SALES DESC ,A.PRODUCT_CODE ASC;

----------------------
-문제-
PRODUCT 테이블과 OFFLINE_SALE 테이블에서 상품코드 별 매출액(판매가 * 판매량) 합계를 출력하는 SQL문을 작성해주세요. 
결과는 매출액을 기준으로 내림차순 정렬해주시고 매출액이 같다면 상품코드를 기준으로 오름차순 정렬해주세요.
//판매량을 처음에는 COUNT를 이용해서 개수를 카운트해야 하는 줄 알았는데, 그게 아니라 그룹화가 이미 되어있어서 합계만 해줘도 되는거였다.

In [ ]:
-- 코드를 작성해주세요
SELECT YEAR(YM) AS YEAR,ROUND(AVG(PM_VAL1),2) AS "PM10" ,ROUND(AVG(PM_VAL2),2) AS "PM2.5"
FROM AIR_POLLUTION
WHERE LOCATION2 = "수원"
GROUP BY YEAR(YM)
ORDER BY YEAR ASC;


//간단하지만 몰랐던 것 평균을 낸 값을 반올림 해야 했지만, 난 처음에 반올림 후에 평균을 함

In [ ]:
-- 코드를 작성해주세요
SELECT ROUTE,CONCAT(ROUND(SUM(D_BETWEEN_DIST),1),'km') AS TOTAL_DISTANCE,CONCAT(ROUND(AVG(D_BETWEEN_DIST),2),'km') AS AVERAGE_DISTANCE
FROM SUBWAY_DISTANCE 
GROUP BY ROUTE
ORDER BY SUM(D_BETWEEN_DIST) DESC;

//단순 문자열 더해주는건 CONCAT을 이용하면 됨

In [ ]:
-- 코드를 작성해주세요
SELECT CASE
WHEN MONTH(DIFFERENTIATION_DATE) BETWEEN 1 AND 3 THEN '1Q'
WHEN MONTH(DIFFERENTIATION_DATE) BETWEEN 4 AND 6 THEN '2Q'
WHEN MONTH(DIFFERENTIATION_DATE) BETWEEN 7 AND 9 THEN '3Q'
WHEN MONTH(DIFFERENTIATION_DATE) BETWEEN 10 AND 12 THEN '4Q'
END AS QUARTER,
COUNT(*) AS ECOLI_COUNT
FROM ECOLI_DATA 
GROUP BY QUARTER
ORDER BY QUARTER ASC;
-------------------------------------------------------------------
SELECT CONCAT(QUARTER(DIFFERENTIATION_DATE),'Q') AS QUARTER,COUNT(*) AS ECOLI_COUNT
FROM ECOLI_DATA
GROUP BY QUARTER
ORDER BY QUARTER;

//두개 방식 둘 다 가능하다.

In [ ]:
-- 코드를 작성해주세요
SELECT YEAR(DIFFERENTIATION_DATE) AS YEAR , 
MAX(SIZE_OF_COLONY) OVER (PARTITION BY YEAR(DIFFERENTIATION_DATE)) - SIZE_OF_COLONY AS YEAR_DEV
,ID
FROM ECOLI_DATA 
ORDER BY YEAR ASC, YEAR_DEV ASC;

//OVER (PARTITION BY YEAR(DIFFERENTIATION_DATE)) 를 통해서 각 년도별로 그룹을 나누게 되는데 MAX(SIZE_OF_COLONY) 연도안에서 가장 큰값을 뽑아내게 된다. 이후 자기자신을
빼서 편차를 구할 수 있게 된다.

SELECT YEAR(DIFFERENTIATION_DATE) AS YEAR , (M.MAX_SIZE - E.SIZE_OF_COLONY) AS YEAR_DEV, E.ID
FROM ECOLI_DATA E
JOIN 
    (SELECT YEAR(DIFFERENTIATION_DATE) AS YEAR ,MAX(SIZE_OF_COLONY) AS MAX_SIZE
     FROM ECOLI_DATA
     GROUP BY YEAR(DIFFERENTIATION_DATE)
    ) M ON YEAR(E.DIFFERENTIATION_DATE) = M.YEAR
ORDER BY YEAR ASC, YEAR_DEV ASC;

//서브쿼리 사용해서 해결

In [ ]:
SELECT C.ID, C.GENOTYPE, P.GENOTYPE AS PARENT_GENOTYPE
FROM ECOLI_DATA C JOIN ECOLI_DATA P ON C.PARENT_ID = P.ID
WHERE C.GENOTYPE & P.GENOTYPE = P.GENOTYPE
ORDER BY C.ID ASC;

//
C.GENOTYPE & P.GENOTYPE = P.GENOTYPE #자식이 부모의 형질을 가지는 것만 출력해야하기 때문에 해당 조건으로 진행
ECOLI_DATA라는 테이블안에 부모와 자식의 데이터가 있기 떄문에 같은 테이블을 두 번 불러서 자식(C) ↔ 부모(P) 관계를 연결 해야 해서 SELF조인을 진행
ECOLI_DATA P ON C.PARENT_ID = P.ID 자식이 부모의 ID값을 부모는 자신의 ID값이 일치해야 연결이된다.

### 2일차 ----------------------------------------------------------------------------

In [ ]:
SELECT A.ID, A.NAME, A.HOST_ID
FROM PLACES A JOIN (SELECT HOST_ID AS H
FROM PLACES 
GROUP BY HOST_ID
HAVING COUNT(HOST_ID) >= 2) B ON A.HOST_ID = B.H
ORDER BY A.ID;
//FROM절에서 서브쿼리를 통한 필터링 방식인데, 필터링을 거쳤기 떄문에 A테이블에서 조건에 맞지 않는 행들은 전부 지워져버린다. 그래서 A.HOST_ID를 해도되는거였고, B.H를 해도 
A.HOST_ID와 동일한 결과값이 나오지만 A.HOST_ID를 하는게 관습적이라고 함.
--------------------------------------------------------------------
SELECT ID, NAME, HOST_ID
FROM PLACES
WHERE HOST_ID IN (
    SELECT HOST_ID
    FROM PLACES
    GROUP BY HOST_ID
    HAVING COUNT(ID) >= 2
)
ORDER BY ID;
//이건 WHERE절에서 조건을 걸어서 필터링을 하는 방식

### 3일차 ----------------------------------------------------------------------------------

In [ ]:
-- 코드를 입력하세요
SELECT CONCAT('/home/grep/src/',B.BOARD_ID,'/',B.FILE_ID,B.FILE_NAME,B.FILE_EXT) AS FILE_PATH
FROM USED_GOODS_BOARD A JOIN USED_GOODS_FILE B ON A.BOARD_ID = B.BOARD_ID
WHERE A.VIEWS = (SELECT MAX(VIEWS) AS VIEWS
                FROM USED_GOODS_BOARD
                )
ORDER BY B.FILE_ID DESC;

//문자형을 붙이는건 CONCAT을 통해서 붙이고, 띄워쓰기를 해야하는 경우에는 ''을 넣어줘야한다 EX: CONCAT(EX,'',TEST,'') >> EX TEST

In [ ]:
SELECT USER_ID,
       NICKNAME,
       CONCAT(CITY, ' ', STREET_ADDRESS1, ' ', STREET_ADDRESS2) AS 전체주소,
       CONCAT(SUBSTRING(TLNO, 1, 3), '-', SUBSTRING(TLNO, 4, 4), '-', SUBSTRING(TLNO, 8, 4)) AS 전화번호
FROM USED_GOODS_USER;

//전화번호같이 추가적으로 글자를 끊어줘야하는건 SUBSTRING을 이용해서 끊어준다.

### 4일차 --------------------------------------------------------------------------

In [ ]:
SELECT COUNT(*) AS FISH_COUNT,MAX(LENGTH) AS MAX_LENGTH,FISH_TYPE
FROM FISH_INFO
GROUP BY FISH_TYPE
HAVING AVG(CASE WHEN LENGTH <= 10 THEN 10 
           ELSE LENGTH
           END) >= 33
ORDER BY FISH_TYPE ASC;

//해당문제에선 길이가 10미만인 경우에는 NULL로 취급하기 때문에 HAVING절에서 길이가 10미만인걸 10으로 취급하는게 불가능하기 떄문에 위와 같은 조건을 걸면 부분적으로 틀리는 
경우가 발생하게 된다. 이를 해결하기 위해서는 IFNULL을 사용해서 해결 할 수 있었다.
-- 코드를 작성해주세요
SELECT COUNT(*) AS FISH_COUNT,MAX(LENGTH) AS MAX_LENGTH,FISH_TYPE
FROM FISH_INFO
GROUP BY FISH_TYPE
HAVING AVG(IFNULL(LENGTH,10)) >= 33
ORDER BY FISH_TYPE ASC;

#CASE문을 사용한다고 했을 땐
CASE WHEN LENGTH IS NULL TEHN 10
     WHEN LENGTH <= 10 THEN 10
     ELSE LENGTH
     END

In [ ]:
-- 코드를 작성해주세요
SELECT ID, CASE 
WHEN SIZE_OF_COLONY <= 100 THEN 'LOW'
WHEN SIZE_OF_COLONY BETWEEN 101 AND 1000 THEN 'MEDIUM'
ELSE 'HIGH' END AS SIZE
FROM ECOLI_DATA
ORDER BY ID

//100이상 1000미만은 101 AND 1000으로 진행해야 한다. 처음에는 SIZE_OF_COLONY > 100 AND SIZE_OF_COLONY <= 1000으로 할려고 했었다.

In [ ]:
-- 코드를 작성해주세요
SELECT ID, 
CASE NTILE(4) OVER (ORDER BY SIZE_OF_COLONY DESC)
WHEN 1 THEN 'CRITICAL'
WHEN 2 THEN 'HIGH'
WHEN 3 THEN 'MEDIUM'
WHEN 4 THEN 'LOW'
END AS COLONY_NAME
FROM ECOLI_DATA
ORDER BY ID ASC;
//크기를 기준으로 할 땐 QUAETER를 사용하는게 아니라 NTILE을 이용해서 구별해야한다. QUAETER함수는 날짜에서 분기를 뽑는 함수이기 때문에 NTILE사용해야한다.

In [ ]:
-- 코드를 입력하세요
SELECT B.ANIMAL_ID,B.ANIMAL_TYPE,B.NAME
FROM ANIMAL_INS A JOIN ANIMAL_OUTS B ON A.ANIMAL_ID = B.ANIMAL_ID
WHERE A.SEX_UPON_INTAKE LIKE '%Intact%' AND B.SEX_UPON_OUTCOME NOT LIKE '%Intact%'
ORDER BY B.ANIMAL_ID ASC;

// 해당부분에서의 문제점은 처음에는 B.SEX_UPON_OUTCOME NOT LIKE '%Intact%' 대신 NOT IN(INTACT)로 진행을 했기 때문에 INTACT만 걸러내야한다는 컴퓨터의 방식으로 
인해 오답처리가 되버렸다. IN을 사용했을 때 INTACT만 걸러내지기 때문에 INTACT MALE 이나 FEAMLE을 걸러내지 못한다는 것 그렇기 때문에 NOT LIKE로 필터링 해줘야한다.

### 5일차 ----------------------------------------------------------------------

In [ ]:
-문제-
보호소에서는 몇 시에 입양이 가장 활발하게 일어나는지 알아보려 합니다. 0시부터 23시까지, 
각 시간대별로 입양이 몇 건이나 발생했는지 조회하는 SQL문을 작성해주세요. 이때 결과는 시간대 순으로 정렬해야 합니다.

#해당문제를 풀었을 때 발생하는 문제점은 테스트값에 0시부터 23시중 없는 시간대가 발생했기 때문에 예시문과 동일하게 나오지 않고, 시간대가 드문드문 있었다는 점
이 문제점을 해결하기 위해 SET을 통한 테이블에 없는 값을 강제로 만들거나 WITH RECURSIVE를 통해 LEFT JOIN을 하는 방법으로 해결하는 것.

SET @hour := -1;
SELECT (@hour := @hour + 1) AS HOUR, (SELECT COUNT(@hour) FROM ANIMAL_OUTS WHERE HOUR(DATETIME) = @hour)AS COUNT
FROM ANIMAL_OUTS 
WHERE @hour < 23;
//SET을 사용했을 때 @변수명 :=(SQL에서는 =을 :=으로 정의해야함) 

WITH RECURSIVE hours AS (
    SELECT 0 AS h
    UNION ALL
    SELECT h + 1
    FROM hours
    WHERE h < 23
)
SELECT h, COUNT(ANIMAL_ID) AS COUNT
FROM hours H LEFT JOIN ANIMAL_OUTS  A ON H.h = HOUR(A.DATETIME)
GROUP BY h
ORDER BY h;

In [ ]:
SELECT CART_ID
FROM CART_PRODUCTS 
WHERE NAME IN ('Milk','Yogurt')
GROUP BY CART_ID
HAVING COUNT(DISTINCT NAME) = 2
ORDER BY CART_ID ASC;

//NAME 안에 2개의 단어가 포함되어야 하는 문제였다. HAVING조건에서 중복을 제거한 후 2개이면 Milk와 Yogurt가 NAME에 포함되어 있는 값만 가지게 된다.

In [ ]:
SELECT CATEGORY,PRICE AS MAX_PRICE,PRODUCT_NAME
FROM FOOD_PRODUCT 
WHERE (CATEGORY,PRICE) IN (SELECT CATEGORY, MAX(PRICE)
                           FROM FOOD_PRODUCT
                           WHERE CATEGORY IN ('국','식용유','김치','과자')
                           GROUP BY CATEGORY
                          )
ORDER BY MAX_PRICE DESC;

//출력시 최대값과 그 최대값에 해당하는 이름을 알고 싶을 땐 서브쿼리를 사용해야한다.

In [ ]:
ONLINE_SALE 테이블과 OFFLINE_SALE 테이블에서 2022년 3월의 오프라인/온라인 상품 판매 데이터의 판매 날짜, 상품ID, 유저ID, 판매량을 출력하는 SQL문을 작성해주세요. OFFLINE_SALE 테이블의 판매 데이터의 USER_ID 값은 NULL 로 표시해주세요. 
결과는 판매일을 기준으로 오름차순 정렬해주시고 판매일이 같다면 상품 ID를 기준으로 오름차순, 상품ID까지 같다면 유저 ID를 기준으로 오름차순 정렬해주세요.

#해당문제에서는 USER_ID, SALES_DATE를 ONLINE_SALE와 OFFLINE_SALE두개의 테이블을 모두 보여줘야 한다는 점이 핵심이다. 처음에는 PRODUCT_ID를 JOIN을 통해 진행을 해야
되는 문제인줄 알았고, 이후 각각의 경우를 CASE를 사용해서 해봤지만, 그렇게 되면 너무 길어지거나 복잡해지는 상황이여서 이상하다고 판단

SELECT DATE_FORMAT(SALES_DATE, '%Y-%m-%d') AS SALES_DATE,PRODUCT_ID,USER_ID,SALES_AMOUNT
FROM ONLINE_SALE 
WHERE SALES_DATE BETWEEN '2022-03-01' AND '2022-03-31'
UNION ALL
SELECT DATE_FORMAT(SALES_DATE, '%Y-%m-%d'),PRODUCT_ID, NULL AS USER_ID, SALES_AMOUNT
FROM OFFLINE_SALE
WHERE SALES_DATE BETWEEN '2022-03-01' AND '2022-03-31'
ORDER BY SALES_DATE ASC ,PRODUCT_ID ASC ,USER_ID ASC;

//이 문제는 결국 두 개의 테이블의 칼럼을 모두 보여줘야 한다는 점이다. 그래서 UNION을 통해 두개의 SELECT문을 통합시켜 해당 문제를 해결 할 수 있었다.

In [ ]:
SELECT A.FLAVOR
FROM FIRST_HALF A
JOIN JULY B ON A.FLAVOR = B.FLAVOR
GROUP BY A.FLAVOR
ORDER BY A.TOTAL_ORDER + SUM(B.TOTAL_ORDER) DESC
LIMIT 3;

//JULY테이블에는 SHIPMENT_ID가 여러개인 FLAVOR가 존재하기 떄문에 이 총합인 TOTAL_ORDER를 구하기 위해서는 SUM을 이용해야 하고 FIRST_HALF에는 하나만 있으니 SUM을
써야한다.

### 6일차 ---------------------------------------------------------------------

In [ ]:
SELECT 
    H.HISTORY_ID,
    ROUND(
        C.DAILY_FEE * (DATEDIFF(H.END_DATE, H.START_DATE) + 1) * (100 - IFNULL(P.DISCOUNT_RATE, 0)) / 100
    ) AS FEE
FROM 
    CAR_RENTAL_COMPANY_RENTAL_HISTORY H
JOIN 
    CAR_RENTAL_COMPANY_CAR C ON H.CAR_ID = C.CAR_ID
LEFT JOIN 
    CAR_RENTAL_COMPANY_DISCOUNT_PLAN P 
    ON C.CAR_TYPE = P.CAR_TYPE 
    AND P.DURATION_TYPE = (
        CASE 
            WHEN DATEDIFF(H.END_DATE, H.START_DATE) + 1 >= 90 THEN '90일 이상'
            WHEN DATEDIFF(H.END_DATE, H.START_DATE) + 1 >= 30 THEN '30일 이상'
            WHEN DATEDIFF(H.END_DATE, H.START_DATE) + 1 >= 7  THEN '7일 이상'
            ELSE NULL 
        END
    )
WHERE 
    C.CAR_TYPE = '트럭'
ORDER BY 
    FEE DESC, 
    H.HISTORY_ID DESC;

#FROM절에서 DURATION_TYPE으로 INNER JOIN을 하지 않는 이유는 할인받을 수 있는 종류가 3개이기 때문에 1개의 트럭값을 찾을려고 했을 때 3개의 트럭할인이 붙기떄문에 데이터
가 증가되어서 뻥튀기 되는 현상이 나와버린다. 그래서 FROM절에서 CASE문을 통해 조건을 건 후 SELECT에서 FEE에 대한 값을 지정하는데, 7일 미만인 경우에는
IFNULL을 통해 필터링이 돼 100%값으로 진행된다. 왜 그렇냐면 CASE문에서 7일 미만은 설정하지 않았기 때문에, 조인을 하게 되면 NULL값이 된다. IFNULL은 해당값이 NULL이면 
뒤에 값으로 반환하기 때문에 NULL인 순간 0을 반환해줘서 100%로 비용이 됨

### 7일차 ---------------------------------------------------------------------------------------

In [ ]:
-- 코드를 작성해주세요
SELECT CASE
WHEN MAX(CASE WHEN CATEGORY = 'Front End' THEN 1 ELSE 0 END) = 1 
        AND MAX(CASE WHEN NAME = 'Python' THEN 1 ELSE 0 END) = 1 THEN 'A'
        WHEN MAX(CASE WHEN NAME = 'C#' THEN 1 ELSE 0 END) = 1 THEN 'B'
        WHEN MAX(CASE WHEN CATEGORY = 'Front End' THEN 1 ELSE 0 END) = 1 THEN 'C'
END AS GRADE,B.ID,B.EMAIL
FROM SKILLCODES A JOIN DEVELOPERS B ON (A.CODE & B.SKILL_CODE) = A.CODE
GROUP BY B.ID,B.EMAIL
HAVING GRADE IS NOT NULL
ORDER BY GRADE ASC, B.ID ASC;

//해당문제에서 그룹별로 묶게 되었을 때 Fron End가 하나라도 있다면 1의 값을 가지게 된다. 이유로는 max를 쓰게 되면 조건중에 해당하게 되면 1을 반환하기 떄문이다. 다른 조건들도 max를 사용해서 문제를 풀어나가게 되고, grade에서 어떤 등급도 만족하지 못하면 
null값이 나오게 되는 결과값이 나와 HAVING조건에서 is not null을 사용해 null값은 제외한다.